brew "homebrew/brew-vulns/brew-vulns"

brew "awscli"
brew "bat"
brew "btop"
brew "coreutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gitleaks"
brew "gum"
brew "mise"
brew "neovim"
brew "opencode"
brew "pstree"
brew "poppler" # pdf tools for codex
brew "ripgrep"
brew "screen"
brew "shellcheck"
brew "starship"
brew "stow"
brew "tmux"
brew "uv"
brew "zoxide"

cask "1password-cli"
cask "cleanshot"
cask "codex"
cask "docker-desktop"
cask "forklift"
cask "ghostty"
cask "hazeover"
cask "libreoffice-still" # for https://github.com/anthropics/skills/blob/main/skills/xlsx/SKILL.md
cask "linearmouse"
cask "opencode-desktop"
cask "rectangle-pro"
cask "soundsource"
cask "sublime-text"
cask "thaw"
